{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.7.3", "userDefinedMetadata": {"signature": {"inputs": {"global_step:0": {"name": "global_step:0", "dtype": "DT_RESOURCE", "tensorShape": {}}, "fed_input_sizes:0": {"name": "fed_input_sizes:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}]}}, "fed_combined_input:0": {"name": "fed_combined_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "5"}]}}}, "outputs": {"rnn_classifier/fc_to_logits/BiasAdd:0": {"name": "rnn_classifier/fc_to_logits/BiasAdd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "419"}]}}, "softmax_outputs:0": {"name": "softmax_outputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "419"}]}}}}}, "modelTopology": {"node": [{"name": "global_step", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/max_pooling/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/max_pooling/Tile/multiples/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/max_pooling/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/max_pooling/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/max_pooling/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/max_pooling/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn_classifier/max_pooling/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/TensorArrayStack/range/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/TensorArrayStack/range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/LSTMCellZeroState/zeros", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/TensorArrayUnstack/range/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/TensorArrayUnstack/range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/LSTMCellZeroState/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "bidi_lstm/bidirectional_rnn/fw/lstm_cell/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "608"}, {"size": "512"}]}}}}}, {"name": "bidi_lstm/bidirectional_rnn/fw/lstm_cell/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/iteration_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/Maximum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/Const_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/concat_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/TensorArrayStack/range/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/TensorArrayStack/range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/LSTMCellZeroState/zeros", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/TensorArrayUnstack/range/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/TensorArrayUnstack/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/TensorArrayUnstack/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/TensorArrayUnstack/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/TensorArrayUnstack/range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/LSTMCellZeroState/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "bidi_lstm/bidirectional_rnn/bw/lstm_cell/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "608"}, {"size": "512"}]}}}}}, {"name": "bidi_lstm/bidirectional_rnn/bw/lstm_cell/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/iteration_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/Convolutions/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "rnn_classifier/Convolutions/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "48"}]}}}}}, {"name": "Convolutions/Conv/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "rnn_classifier/Convolutions/Conv_1/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_1/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_2/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_2/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "rnn_classifier/Convolutions/Conv_3/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_3/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_3/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_4/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_4/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_4/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "rnn_classifier/Convolutions/Conv_5/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_5/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_5/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "rnn_classifier/Convolutions/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "rnn_classifier/Convolutions/Conv_6/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_6/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_6/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_7/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/Convolutions/Conv_7/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_7/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_8/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_8/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_8/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "rnn_classifier/Convolutions/strided_slice_3/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "rnn_classifier/Convolutions/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_9/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_9/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_9/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_10/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_10/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_10/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_11/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_11/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_11/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fed_combined_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/max_pooling/Max/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fc_to_logits/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "419"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fully_connected_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}, {"size": "384"}]}}}}}, {"name": "rnn_classifier/Convolutions/strided_slice_4/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_4/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "rnn_classifier/Convolutions/strided_slice_4/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "rnn_classifier/Convolutions/Conv_12/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_12/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_12/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "rnn_classifier/Convolutions/Conv_13/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_13/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_13/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_14/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_14/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Convolutions/Conv_14/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/Maximum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/Const_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/concat_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "fed_input_sizes", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}]}}}}, {"name": "rnn_classifier/compute_lengths/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "fc_to_logits/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}, {"size": "419"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn_classifier/max_pooling/ones_like/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Select/Enter", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/zeros"], "attr": {"frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2Z3L2Z3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Enter_3", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/LSTMCellZeroState/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2Z3L2Z3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Enter_4", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/LSTMCellZeroState/zeros_1"], "attr": {"frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2Z3L2Z3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/lstm_cell/MatMul/Enter", "op": "Enter", "input": ["bidi_lstm/bidirectional_rnn/fw/lstm_cell/kernel"], "attr": {"frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2Z3L2Z3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/lstm_cell/BiasAdd/Enter", "op": "Enter", "input": ["bidi_lstm/bidirectional_rnn/fw/lstm_cell/bias"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2Z3L2Z3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Enter_1", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/time"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2Z3L2Z3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Enter", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/iteration_counter"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2Z3L2Z3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Select/Enter", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/zeros"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2J3L2J3L3doaWxlL3doaWxlX2NvbnRleHQ="}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Enter_3", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/LSTMCellZeroState/zeros"], "attr": {"frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2J3L2J3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Enter_4", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/LSTMCellZeroState/zeros_1"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2J3L2J3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/lstm_cell/MatMul/Enter", "op": "Enter", "input": ["bidi_lstm/bidirectional_rnn/bw/lstm_cell/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2J3L2J3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/lstm_cell/BiasAdd/Enter", "op": "Enter", "input": ["bidi_lstm/bidirectional_rnn/bw/lstm_cell/bias"], "attr": {"frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2J3L2J3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Enter_1", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/time"], "attr": {"frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2J3L2J3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Enter", "op": "Enter", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/iteration_counter"], "attr": {"frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2J3L2J3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/strided_slice", "op": "StridedSlice", "input": ["fed_combined_input", "rnn_classifier/Convolutions/strided_slice/stack", "rnn_classifier/Convolutions/strided_slice/stack_1", "rnn_classifier/Convolutions/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_1", "op": "StridedSlice", "input": ["fed_combined_input", "rnn_classifier/Convolutions/strided_slice_1/stack", "rnn_classifier/Convolutions/strided_slice_1/stack_1", "rnn_classifier/Convolutions/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_2", "op": "StridedSlice", "input": ["fed_combined_input", "rnn_classifier/Convolutions/strided_slice_2/stack", "rnn_classifier/Convolutions/strided_slice_2/stack_1", "rnn_classifier/Convolutions/strided_slice_2/stack_2"], "attr": {"begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_3", "op": "StridedSlice", "input": ["fed_combined_input", "rnn_classifier/Convolutions/strided_slice_3/stack", "rnn_classifier/Convolutions/strided_slice_3/stack_1", "rnn_classifier/Convolutions/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}}}, {"name": "rnn_classifier/Convolutions/strided_slice_4", "op": "StridedSlice", "input": ["fed_combined_input", "rnn_classifier/Convolutions/strided_slice_4/stack", "rnn_classifier/Convolutions/strided_slice_4/stack_1", "rnn_classifier/Convolutions/strided_slice_4/stack_2"], "attr": {"begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/compute_lengths/Sum", "op": "Sum", "input": ["fed_input_sizes", "rnn_classifier/compute_lengths/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/zeros_enter", "op": "Const", "input": ["^rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Select/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Merge_3", "op": "Merge", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Enter_3", "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/NextIteration_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Merge_4", "op": "Merge", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Enter_4", "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/NextIteration_4"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/bidi_lstm/bidirectional_rnn/fw/lstm_cell/kernel_enter", "op": "Const", "input": ["^rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/lstm_cell/MatMul/Enter"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "608"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/bidi_lstm/bidirectional_rnn/fw/lstm_cell/bias_enter", "op": "Const", "input": ["^rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/lstm_cell/BiasAdd/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Merge_1", "op": "Merge", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Enter_1", "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/NextIteration_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Merge", "op": "Merge", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/Enter", "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/NextIteration"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/zeros_enter", "op": "Const", "input": ["^rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Select/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Merge_3", "op": "Merge", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Enter_3", "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/NextIteration_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Merge_4", "op": "Merge", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Enter_4", "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/NextIteration_4"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/bidi_lstm/bidirectional_rnn/bw/lstm_cell/kernel_enter", "op": "Const", "input": ["^rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/lstm_cell/MatMul/Enter"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "608"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/bidi_lstm/bidirectional_rnn/bw/lstm_cell/bias_enter", "op": "Const", "input": ["^rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/lstm_cell/BiasAdd/Enter"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Merge_1", "op": "Merge", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Enter_1", "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/NextIteration_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Merge", "op": "Merge", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/Enter", "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/NextIteration"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/strided_slice", "rnn_classifier/Convolutions/Conv/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/strided_slice_1", "rnn_classifier/Convolutions/Conv_3/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_6/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/strided_slice_2", "rnn_classifier/Convolutions/Conv_6/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_9/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/strided_slice_3", "rnn_classifier/Convolutions/Conv_9/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_12/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/strided_slice_4", "rnn_classifier/Convolutions/Conv_12/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/Max", "op": "Max", "input": ["rnn_classifier/compute_lengths/Sum", "rnn_classifier/max_pooling/SequenceMask/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/compute_lengths/Sum", "rnn_classifier/max_pooling/SequenceMask/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/while/GreaterEqual/Enter", "op": "Enter", "input": ["rnn_classifier/compute_lengths/Sum"], "attr": {"frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2Z3L2Z3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/Max", "op": "Max", "input": ["rnn_classifier/compute_lengths/Sum", "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/Const_4"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/while/GreaterEqual/Enter", "op": "Enter", "input": ["rnn_classifier/compute_lengths/Sum"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "cm5uX2NsYXNzaWZpZXIvYmlkaV9sc3RtL2JpZGlyZWN0aW9uYWxfcm5uL2J3L2J3L3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/Max", "op": "Max", "input": ["rnn_classifier/compute_lengths/Sum", "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/Const_4"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv/conv1d", "op": "_FusedConv2D", "input": ["rnn_classifier/Convolutions/Conv/conv1d/ExpandDims", "rnn_classifier/Convolutions/Conv/conv1d/ExpandDims_1", "Convolutions/Conv/biases"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "rnn_classifier/Convolutions/Conv_3/conv1d", "op": "_FusedConv2D", "input": ["rnn_classifier/Convolutions/Conv_3/conv1d/ExpandDims", "rnn_classifier/Convolutions/Conv_3/conv1d/ExpandDims_1", "Convolutions/Conv_3/biases"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "rnn_classifier/Convolutions/Conv_6/conv1d", "op": "_FusedConv2D", "input": ["rnn_classifier/Convolutions/Conv_6/conv1d/ExpandDims", "rnn_classifier/Convolutions/Conv_6/conv1d/ExpandDims_1", "Convolutions/Conv_6/biases"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "rnn_classifier/Convolutions/Conv_9/conv1d", "op": "_FusedConv2D", "input": ["rnn_classifier/Convolutions/Conv_9/conv1d/ExpandDims", "rnn_classifier/Convolutions/Conv_9/conv1d/ExpandDims_1", "Convolutions/Conv_9/biases"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "rnn_classifier/Convolutions/Conv_12/conv1d", "op": "_FusedConv2D", "input": ["rnn_classifier/Convolutions/Conv_12/conv1d/ExpandDims", "rnn_classifier/Convolutions/Conv_12/conv1d/ExpandDims_1", "Convolutions/Conv_12/biases"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/Maximum", "op": "Maximum", "input": ["rnn_classifier/max_pooling/SequenceMask/Const_1", "rnn_classifier/max_pooling/SequenceMask/Max"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/Maximum", "op": "Maximum", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/Maximum/x", "rnn_classifier/bidi_lstm/bidirectional_rnn/fw/fw/Max"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/Maximum", "op": "Maximum", "input": ["rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/Maximum/x", "rnn_classifier/bidi_lstm/bidirectional_rnn/bw/bw/Max"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv/BiasAdd", "op": "Squeeze", "input": ["rnn_classifier/Convolutions/Conv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "rnn_classifier/Convolutions/Conv_3/BiasAdd", "op": "Squeeze", "input": ["rnn_classifier/Convolutions/Conv_3/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "rnn_classifier/Convolutions/Conv_6/BiasAdd", "op": "Squeeze", "input": ["rnn_classifier/Convolutions/Conv_6/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "rnn_classifier/Convolutions/Conv_9/BiasAdd", "op": "Squeeze", "input": ["rnn_classifier/Convolutions/Conv_9/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "rnn_classifier/Convolutions/Conv_12/BiasAdd", "op": "Squeeze", "input": ["rnn_classifier/Convolutions/Conv_12/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/Range", "op": "Range", "input": ["rnn_classifier/max_pooling/SequenceMask/Const_2", "rnn_classifier/max_pooling/SequenceMask/Maximum", "rnn_classifier/max_pooling/SequenceMask/Const_3"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv/Relu", "op": "Relu", "input": ["rnn_classifier/Convolutions/Conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_3/Relu", "op": "Relu", "input": ["rnn_classifier/Convolutions/Conv_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_6/Relu", "op": "Relu", "input": ["rnn_classifier/Convolutions/Conv_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_9/Relu", "op": "Relu", "input": ["rnn_classifier/Convolutions/Conv_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_12/Relu", "op": "Relu", "input": ["rnn_classifier/Convolutions/Conv_12/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/max_pooling/SequenceMask/Less", "op": "Less", "input": ["rnn_classifier/max_pooling/SequenceMask/Range", "rnn_classifier/max_pooling/SequenceMask/ExpandDims"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/Conv/Relu", "rnn_classifier/Convolutions/Conv_1/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_4/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/Conv_3/Relu", "rnn_classifier/Convolutions/Conv_4/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn_classifier/Convolutions/Conv_7/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/Conv_6/Relu", "rnn_classifier/Convolutions/Conv_7/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "rnn_classifier/Convolutions/Conv_10/conv1d/ExpandDims", "op": "ExpandDims", "input": ["rnn_classifier/Convolutions/Conv_9/Relu", 